; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-71)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l9)
    (at p3 l8)
    (at p4 l1)
    (at p5 l7)
    (at p6 l10)
    (at p7 l4)
    (at p8 l12)
    (at p9 l8)
    (at p10 l8)
    (at p11 l5)
    (at p12 l6)
    (at v1 l4)
    (at v2 l4)
    (at v3 l12)
    (at v4 l10)
    (at v5 l11)
    (at v6 l12)
    (road l12 l7)
    (road l11 l2)
    (road l8 l6)
    (road l13 l2)
    (road l1 l6)
    (road l2 l5)
    (road l2 l11)
    (road l6 l8)
    (road l11 l1)
    (road l10 l11)
    (road l13 l4)
    (road l11 l10)
    (road l2 l7)
    (road l9 l13)
    (road l1 l11)
    (road l6 l1)
    (road l2 l13)
    (road l7 l12)
    (road l3 l2)
    (road l5 l2)
    (road l4 l13)
    (road l2 l3)
    (road l13 l9)
    (road l7 l2)
    (road l6 l11)
    (road l11 l6)
    (road l1 l10)
    (road l10 l1)
    (road l11 l13)
    (road l13 l11)
    (road l3 l7)
    (road l7 l3)
    (road l3 l5)
    (road l5 l3)
    (road l6 l13)
    (road l13 l6)
    (road l4 l11)
    (road l11 l4)
    (road l6 l12)
    (road l12 l6)
    (road l9 l12)
    (road l12 l9)
    (road l1 l3)
    (road l3 l1)
    (road l9 l10)
    (road l10 l9)
    (road l3 l11)
    (road l11 l3)
    (road l1 l5)
    (road l5 l1)
    (road l3 l6)
    (road l6 l3)
    (road l12 l13)
    (road l13 l12)
    (road l10 l13)
    (road l13 l10)
    (road l7 l13)
    (road l13 l7)
    (road l2 l8)
    (road l8 l2)
    (road l4 l5)
    (road l5 l4)
    (road l2 l6)
    (road l6 l2)
    (road l6 l9)
    (road l9 l6)
    (road l3 l12)
    (road l12 l3)
    (road l3 l10)
    (road l10 l3)
    (road l4 l7)
    (road l7 l4)
    (road l1 l2)
    (road l2 l1)
    (road l1 l4)
    (road l4 l1)
    (road l1 l12)
    (road l12 l1)
    (road l5 l12)
    (road l12 l5)
    (road l4 l8)
    (road l8 l4)
    (road l8 l9)
    (road l9 l8)
    (road l9 l11)
    (road l11 l9)
    (road l4 l10)
    (road l10 l4)
    (road l7 l11)
    (road l11 l7)
    )
 (:goal (and 
(at p1 l6)
(at p2 l7)
(at p3 l10)
(at p4 l9)
(at p5 l13)
(at p6 l4)
(at p7 l7)
))
)

; plan
1. (pick-up v2 l4 p1 c1 c2)
   deleted: (at p1 l4) (capacity v2 c2)
   added: (in p1 v2) (capacity v2 c1)
   goals met: 0 of 7
2. (drive v2 l4 l1)
   deleted: (at v2 l4)
   added: (at v2 l1)
   goals met: 0 of 7
3. (pick-up v2 l1 p4 c0 c1)
   deleted: (at p4 l1) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 0 of 7
4. (drive v2 l1 l6)
   deleted: (at v2 l1)
   added: (at v2 l6)
   goals met: 0 of 7
5. (drop v2 l6 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l6) (capacity v2 c1)
   goals met: 1 of 7
6. (drive v2 l6 l8)
   deleted: (at v2 l6)
   added: (at v2 l8)
   goals met: 1 of 7
7. (pick-up v2 l8 p3 c0 c1)
   deleted: (at p3 l8) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 1 of 7
8. (drive v2 l8 l9)
   deleted: (at v2 l8)
   added: (at v2 l9)
   goals met: 1 of 7
9. (drop v2 l9 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l9) (capacity v2 c1)
   goals met: 2 of 7
10. (pick-up v2 l9 p2 c0 c1)
   deleted: (at p2 l9) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 2 of 7
11. (drive v2 l9 l10)
   deleted: (at v2 l9)
   added: (at v2 l10)
   goals met: 2 of 7
12. (drop v2 l10 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l10) (capacity v2 c1)
   goals met: 3 of 7
13. (pick-up v2 l10 p6 c0 c1)
   deleted: (at p6 l10) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 3 of 7
14. (drive v2 l10 l4)
   deleted: (at v2 l10)
   added: (at v2 l4)
   goals met: 3 of 7
15. (drop v2 l4 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l4) (capacity v2 c1)
   goals met: 4 of 7
16. (pick-up v2 l4 p7 c0 c1)
   deleted: (at p7 l4) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 4 of 7
17. (drive v2 l4 l7)
   deleted: (at v2 l4)
   added: (at v2 l7)
   goals met: 4 of 7
18. (drop v2 l7 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l7) (capacity v2 c1)
   goals met: 5 of 7
19. (pick-up v2 l7 p5 c0 c1)
   deleted: (at p5 l7) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 5 of 7
20. (drop v2 l7 p7 c0 c1)
   deleted: (in p7 v2) (capacity v2 c0)
   added: (at p7 l7) (capacity v2 c1)
   goals met: 6 of 7
21. (drive v2 l7 l13)
   deleted: (at v2 l7)
   added: (at v2 l13)
   goals met: 6 of 7
22. (drop v2 l13 p5 c1 c2)
   deleted: (in p5 v2) (capacity v2 c1)
   added: (at p5 l13) (capacity v2 c2)
   goals met: 7 of 7
